[
  {
    "id": "1",
    "categorie": "programming",
    "titel": "Object-Oriented Programming using C++",
    "img": "https://lh6.googleusercontent.com/yPsibbUh1aHOvi0U3-wtdlNpWWutbyYULv1PLkx0QlOOq81DiXVvPgvKVrtY7Ef1yZF5NLabXrHBjHL80lx9hTqR_64jGRFZdbR9FIs4LDR9RcEn1M9LX_D5i4fYKR4vNZA-dZ9R",
    "des": "In this course you will learn how to become a C++ Object-Oriented programmer by learning to do programming hands-on. This course is easy to understand and will take you from not knowing any C++ Object-Oriented Programming to becoming proficient in the C++ language. The terminology is simply to understand and taught in easy to understand plain English.You will walk through c++ source code, compile and run the examples to get a full understanding of the topics. This course is expected to take about a week (40 hours) to complete if you go through the entire examples.The lectures are structures in a step-by-step fashion to make the concept easily understandable with solid examples.You should take this course to help you learn one of the hottest programming languages in use today in industry.",
    "learn": [
      "Learn the C++ Object Oriented Programming language step-by-step.",
      "Learn to program with hands-on approach.",
      "Quickly master key topics such as: Objects, Classes, Polymorphism & Inheritance.",
      "Easy to follow lectures: Theory quickly followed with real examples that run!"
    ],
    "requirments": [
      "No pre-requisites. This is your first course. Bring an open mind and have fun.",
      "Just have a Windows, Linux or Apple's Mac OS machine to do the examples yourself so you can learn quickly."
    ],
    "topic_covered": [
      "Classes",
      "Objects",
      "Inheritance",
      "Polymorphism",
      "Intro. to Programming in C",
      "Installation of a C Compiler",
      "Variables",
      "Arrays",
      "Vectors",
      "Constants",
      "Arithmetic Operators",
      "Value Assignments",
      "Control Structures",
      "For loops",
      "While loops",
      "Do…while loops,",
      "Switch & break statements.",
      "Functions"
    ],
    "price": "$50",
    "ratings": "4.5"
  },
  {
    "id": "2",
    "categorie": "programming",
    "titel": "Python Programming",
    "img": "https://contentstatic.techgig.com/thumb/msid-79386213,width-460,resizemode-4/5-Myths-around-Python-programming-language-that-every-programmer-must-know.jpg?88712",
    "des": "Welcome to the Complete Python Course! Learn Python from a software developer. If you want to master Python and write efficient, elegant, and simple code, this is the course you've been looking for! Even if you have no programming experience, this course will give you a super-strong foundation and teach you how to use Python to achieve any goal.We've crafted every piece of content to be concise and straightforward, while never leaving you confused:Hundreds of code-along videos with in-depth explanations, Dozens of presentations with animated diagrams, Quizzes, Coding exercises, Python projects for you to learn to make real Python applications",
    "learn": [
      "From foundations to expert, learn about every major Python topic, working with Python 3.",
      "Master Object-Oriented Programming and structure your Python programs like a professional.",
      "Automate extracting data from websites using web scraping libraries like BeautifulSoup and Selenium.",
      "Interact with REST APIs using Python and build a currency converter!"
    ],
    "requirments": [
      "Access to a computer with an internet connection. Everything else we use in the course is publicly available and we'll guide you through getting it.",
      "There are no other requirements, besides getting started!"
    ],
    "topic_covered": [
      "Command Line Basics",
      "Installing Python",
      "Running Python Code",
      "Strings and Numbers",
      "String Formatting",
      "Lists, Dictionaries, Tuples, and Sets",
      "Functions and lambdas",
      "Decorators",
      "Scope",
      "args/kwargs and default parameter values",
      "The concept of mutability",
      "Built-in Functions",
      "Debugging and Error Handling"
    ],
    "price": "$60",
    "ratings": "4.8"
  },
  {
    "id": "3",
    "categorie": "hardware",
    "titel": "Computer Engineering & Hardware",
    "img": "https://scholarshipguidance.com/wage-detail-images/526/what-skills-should-a-computer-hardware-engineer-have.jpg",
    "des": "Course on the fundamentals of computer engineering and information technology. Course on the fundamentals of computer engineering and information technology Information Technology Information Technology Information Technology Information Technology Information Technology Information Technology Information Technology Intensive discussion of the fundamentals of computer engineering is found in the computer engineering is integrated with the electronic are electrical engineering and computer science courses that are closely related to the hardware and software of computers that are both of Technology is working together to develop Software and Hardware related Technologies. Computer engineering Information Technology fundamentals tutorial. Course on the fundamentals of computer engineering and information technology Computer Science and Engineering Architecture of the Computer. The fundamentals of computer engineering organization and architecture are covered in detail. It is our responsibility to learn about the fundamentals of computer engineering, organization, and architecture in computer engineering, which will assist you in learning about the fundamentals of computer engineering in computer engineering responsibility to learn about the hardware related Technologies which will assist you in learning about the all aspects of information technology and computer science and Electronic Engineering which is our responsibility to learn about that these Technologies and export.",
    "learn": [
      "Computer Engineering",
      "Operating Systems and IT",
      "Computer Engineering IT Fundamentals organization",
      "Computer Hardware"
    ],
    "requirments": ["Computer basic Knowledge"],
    "topic_covered": [
      "Components of a Computer Should Be Recognized",
      "Learn about the many computer types that exist today.",
      "Purchase the Most Perfect Computers - Computer Purchasing Guidelines",
      "Learn about the Desktop Components and how they work.",
      "Recognize the pros and disadvantages of having everything in one place.",
      "Understand the Concepts of a Laptop",
      "Learn Everything About Windows 10",
      "Learn how to install Windows 10 on your computer.",
      "Maintenance and troubleshooting for the Windows 10 operating system",
      "Virus on the computer"
    ],
    "price": "$30",
    "ratings": "4.2"
  },
  {
    "id": "4",
    "categorie": "electronics",
    "titel": "Introduction to Digital Electronics",
    "img": "https://collegeacademy.in/images/ex-blogs/deld.jpg",
    "des": "Digital electronics is essential to understanding the design and working of a wide range of applications, from consumer and industrial electronics to communications; from embedded systems, and computers to security and military equipment. As the devices used in these applications decrease in size and employ more complex technology, it is essential for engineers and students to fully understand both the fundamentals and also the implementation and application principles of digital electronics, devices and integrated circuits, thus enabling them to use the most appropriate and effective technique to suit their technical needs. Digital Electronics: in one volume, both the fundamentals of digital electronics and the applications of digital devices and integrated circuits. This Lecture Series is different from similar Lectures on the subject in more than one way. Each chapter in the course, whether it is related to operational fundamentals or applications, is amply illustrated with diagrams and design examples. In addition, the lectures cover several new topics, which are of relevance to any one having an interest in digital electronics While the course covers in entirety what is required by undergraduate and graduate level students of engineering in electrical, electronics, computer science and information technology disciplines, it is intended to be a very useful course for professionals, R&D scientists and students at post graduate level.",
    "learn": [
      "Number Systems.",
      "Conversion of number systems",
      "Arithmetic operations",
      "Binary, decimal, octal, and hexadecimal numbers",
      "Compliments of numbers"
    ],
    "requirments": [
      "Candidate must have willingness and desire to learn the Digital Electronics to implement the knowledge in modern world."
    ],
    "topic_covered": [],
    "price": "$20",
    "ratings": "4.1"
  },
  {
    "id": "5",
    "categorie": "multimedia",
    "titel": "Game Development",
    "img": "https://www.arenaparkstreet.com/blog/wp-content/uploads/2021/05/Game-Development.png",
    "des": "This is the long-awaited sequel to the Complete Unity Developer - one of the most popular e-learning courses on the internet! Completely re-worked from scratch with brand-new projects and our latest teaching techniques. You will benefit from the fact we have already taught over a million students programming and game development, many shipping commercial games as a result.Unity is an incredible 3D package used for making video games, architectural and medical imaging and more. The challenge is that it's big and complicated to use, especially for complete beginners to coding and game development. We make learning to code easy and fun by leading you step-by-step through the process of creating exciting games.Get plugged into our communities of amazing developers on Facebook (nearly 20k), in our own Teaching Assistant-curated Community, and our student Discord chat channel.This course has full professional-produced English closed-captions.If you're reading this you probably already have everything you need to get started. Unity is a free download. With regular access to an internet connection you'll be able to engage in our thriving community. Even if you have no experience with coding, or with 3D packages, we will guide you through everything from first principles. Starting slow, then building on what you learn, you'll soon have a very solid working knowledge of Unity.Don't take our word for it, please see the amazing reviews students have taken the time to write. We are proud to be transforming lives, and equipping 1000s of people with valuable new skills. We would love you to become one of them now.",
    "learn": [
      "Learn C# from scratch. A powerful modern language.",
      "Gain an excellent general knowledge of video game design.",
      "Transfer your knowledge to .NET, other languages, and more.",
      "Make 2.5D and 3D games in Unity",
      "Practical exercises EVERY VIDEO to build actual skills."
    ],
    "requirments": [
      "PC or Mac capable of running Unity 2017 or later.",
      "Regular internet access for Q&A and community."
    ],
    "topic_covered": [],
    "price": "$30",
    "ratings": "4.3"
  }
]
